---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesBackDirn1
source: html/f26c54cf-435b-e5b1-37b5-2568ddb6d201.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesBackDirn1 Property

"Interior Major Number Of Lines"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemNumberOfLinesBackDirn1 { get; }
```